results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN-200sec/50M-KEYS/8/batchsize-512/ycsbwklda/CII.out
Setting g_min_fd 3 
Setting g_min_fd 3 
RocksDB:    version 5.4
Date:       Sun Mar  3 21:29:35 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwklda    :      30.952 micros/op 32308 ops/sec; ( reads:406648 writes:405351 total:50000000 found:406648)
	Command being timed: "/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=200 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwklda --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 146.86
	System time (seconds): 163.67
	Percent of CPU this job got: 152%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 3:24.22
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 2058248
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 71
	Minor (reclaiming a frame) page faults: 5293973
	Voluntary context switches: 4610614
	Involuntary context switches: 1624
	Swaps: 0
	File system inputs: 41707992
	File system outputs: 237609880
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[83510.739831] sh (251905): drop_caches: 3
[83510.810958] sh (251913): drop_caches: 3
[83545.001608] write_proc_unbounded: Value of write = 1
[83545.001624] write_proc_2mb_limit: Value of write = 1
[83545.001630] write_proc_bitmap_shift: Value of write = 38
[83545.008786] write_proc_unbounded: Value of write = 1
[83545.008799] write_proc_2mb_limit: Value of write = 1
[83545.008804] write_proc_bitmap_shift: Value of write = 38
[83545.797541] write_proc_unbounded: Value of write = 0
[83545.797554] write_proc_2mb_limit: Value of write = 0
[83545.797900] write_proc_unbounded: Value of write = 0
[83545.797913] write_proc_2mb_limit: Value of write = 0
[83545.798112] write_proc_unbounded: Value of write = 0
[83545.798134] write_proc_2mb_limit: Value of write = 0
[83545.798154] write_proc_unbounded: Value of write = 0
[83545.798163] write_proc_2mb_limit: Value of write = 0
[83545.798193] write_proc_unbounded: Value of write = 0
[83545.798209] write_proc_2mb_limit: Value of write = 0
[83545.798511] write_proc_unbounded: Value of write = 0
[83545.798518] write_proc_2mb_limit: Value of write = 0
[83545.798566] write_proc_unbounded: Value of write = 0
[83545.798573] write_proc_2mb_limit: Value of write = 0
[83545.798666] write_proc_unbounded: Value of write = 0
[83545.798671] write_proc_2mb_limit: Value of write = 0
[83545.798854] write_proc_unbounded: Value of write = 0
[83545.798866] write_proc_2mb_limit: Value of write = 0
[83545.799149] write_proc_unbounded: Value of write = 0
[83545.799159] write_proc_2mb_limit: Value of write = 0
[83545.799187] write_proc_unbounded: Value of write = 0
[83545.799195] write_proc_2mb_limit: Value of write = 0
[83545.799546] write_proc_unbounded: Value of write = 0
[83545.799552] write_proc_2mb_limit: Value of write = 0
[83545.799587] write_proc_unbounded: Value of write = 0
[83545.799594] write_proc_2mb_limit: Value of write = 0
[83545.799772] write_proc_unbounded: Value of write = 0
[83545.799777] write_proc_2mb_limit: Value of write = 0
[83545.799837] write_proc_unbounded: Value of write = 0
[83545.799852] write_proc_2mb_limit: Value of write = 0
[83545.799987] write_proc_unbounded: Value of write = 0
[83545.800011] write_proc_2mb_limit: Value of write = 0
[83545.800065] write_proc_unbounded: Value of write = 0
[83545.800073] write_proc_2mb_limit: Value of write = 0
[83545.800345] write_proc_unbounded: Value of write = 0
[83545.800353] write_proc_2mb_limit: Value of write = 0
[83545.800375] write_proc_unbounded: Value of write = 0
[83545.800384] write_proc_unbounded: Value of write = 0
[83545.800386] write_proc_2mb_limit: Value of write = 0
[83545.800393] write_proc_2mb_limit: Value of write = 0
[83545.800690] write_proc_unbounded: Value of write = 0
[83545.800696] write_proc_2mb_limit: Value of write = 0
[83545.800784] write_proc_unbounded: Value of write = 0
[83545.800792] write_proc_2mb_limit: Value of write = 0
[83545.800968] write_proc_unbounded: Value of write = 0
[83545.800975] write_proc_2mb_limit: Value of write = 0
[83545.801157] write_proc_unbounded: Value of write = 0
[83545.801165] write_proc_2mb_limit: Value of write = 0
[83545.801724] write_proc_unbounded: Value of write = 0
[83545.801729] write_proc_2mb_limit: Value of write = 0
[83545.802244] write_proc_unbounded: Value of write = 0
[83545.802251] write_proc_2mb_limit: Value of write = 0
[83545.802405] write_proc_unbounded: Value of write = 0
[83545.802411] write_proc_2mb_limit: Value of write = 0
[83545.803188] write_proc_unbounded: Value of write = 0
[83545.803193] write_proc_2mb_limit: Value of write = 0
[83545.803629] write_proc_unbounded: Value of write = 0
[83545.803636] write_proc_2mb_limit: Value of write = 0
[83545.803768] write_proc_unbounded: Value of write = 0
[83545.803773] write_proc_2mb_limit: Value of write = 0
[83545.803907] write_proc_unbounded: Value of write = 0
[83545.803914] write_proc_2mb_limit: Value of write = 0
[83545.804061] write_proc_unbounded: Value of write = 0
[83545.804066] write_proc_2mb_limit: Value of write = 0
[83749.171366] write_proc_unbounded: Value of write = 0
[83749.171388] write_proc_2mb_limit: Value of write = 0
[83749.223466] write_proc_unbounded: Value of write = 0
[83749.223479] write_proc_2mb_limit: Value of write = 0