results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN-200sec/50M-KEYS/8/batchsize-512/ycsbwklda/CIPI_PERF.out
Setting g_min_fd 4 
Setting g_min_fd 4 
RocksDB:    version 5.4
Date:       Sun Mar  3 20:14:23 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwklda    :      30.195 micros/op 33118 ops/sec; ( reads:419192 writes:417807 total:50000000 found:419192)
	Command being timed: "/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=200 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwklda --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 178.46
	System time (seconds): 195.86
	Percent of CPU this job got: 178%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 3:29.96
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 1964580
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 66
	Minor (reclaiming a frame) page faults: 5469832
	Voluntary context switches: 19019143
	Involuntary context switches: 2864
	Swaps: 0
	File system inputs: 42387776
	File system outputs: 205900832
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[78958.193900] sh (233813): drop_caches: 3
[78958.311491] sh (233820): drop_caches: 3
[78980.888344] sh (233861): drop_caches: 3
[78980.935704] sh (233868): drop_caches: 3
[78982.580170] sh (233877): drop_caches: 3
[78982.619077] sh (233884): drop_caches: 3
[78987.669047] sh (233892): drop_caches: 3
[78987.706989] sh (233899): drop_caches: 3
[78995.500847] sh (234394): drop_caches: 3
[78995.590489] sh (234401): drop_caches: 3
[79000.641436] sh (234409): drop_caches: 3
[79000.690113] sh (234416): drop_caches: 3
[79027.795521] write_proc_unbounded: Value of write = 1
[79027.795530] write_proc_2mb_limit: Value of write = 1
[79027.795534] write_proc_bitmap_shift: Value of write = 38
[79027.800618] write_proc_unbounded: Value of write = 1
[79027.800628] write_proc_2mb_limit: Value of write = 1
[79027.800632] write_proc_bitmap_shift: Value of write = 38
[79237.703290] write_proc_unbounded: Value of write = 0
[79237.703298] write_proc_2mb_limit: Value of write = 0
[79237.760717] write_proc_unbounded: Value of write = 0
[79237.760730] write_proc_2mb_limit: Value of write = 0